HaimYosefHaim/pow/v3.1/platform/Device/SiliconLabs/EFM32PG23/Include/efm32pg23b200f512gm48.h
/** @} End of group EFM32PG23B200F512GM48_Part */

/**************************************************************************//**
 * @defgroup EFM32PG23B200F512GM48_Peripheral_TypeDefs EFM32PG23B200F512GM48 Peripheral TypeDefs
 * @{
 * @brief Device Specific Peripheral Register Structures
 *****************************************************************************/
#include "efm32pg23_scratchpad.h"
#include "efm32pg23_emu.h"
#include "efm32pg23_cmu.h"
#include "efm32pg23_hfrco.h"
#include "efm32pg23_fsrco.h"
#include "efm32pg23_dpll.h"
#include "efm32pg23_lfxo.h"
#include "efm32pg23_lfrco.h"
#include "efm32pg23_ulfrco.h"
#include "efm32pg23_msc.h"
#include "efm32pg23_icache.h"
#include "efm32pg23_prs.h"
#include "efm32pg23_gpio.h"
#include "efm32pg23_ldma.h"
#include "efm32pg23_ldmaxbar.h"
#include "efm32pg23_timer.h"
#include "efm32pg23_usart.h"
#include "efm32pg23_burtc.h"
#include "efm32pg23_i2c.h"
#include "efm32pg23_syscfg.h"
#include "efm32pg23_buram.h"
#include "efm32pg23_gpcrc.h"
#include "efm32pg23_dcdc.h"
#include "efm32pg23_mailbox.h"
#include "efm32pg23_eusart.h"
#include "efm32pg23_sysrtc.h"
#include "efm32pg23_lcd.h"
#include "efm32pg23_keyscan.h"
#include "efm32pg23_mpahbram.h"
#include "efm32pg23_lcdrf.h"
#include "efm32pg23_pfmxpprf.h"
#include "efm32pg23_aes.h"
#include "efm32pg23_smu.h"
#include "efm32pg23_letimer.h"
#include "efm32pg23_iadc.h"
#include "efm32pg23_acmp.h"
#include "efm32pg23_amuxcp.h"
#include "efm32pg23_vdac.h"
#include "efm32pg23_pcnt.h"
#include "efm32pg23_lesense.h"
#include "efm32pg23_hfxo.h"
#include "efm32pg23_wdog.h"
#include "efm32pg23_semailbox.h"
#include "efm32pg23_devinfo.h"

/* Custom headers for LDMAXBAR and PRS mappings */
#include "efm32pg23_prs_signals.h"
#include "efm32pg23_dma_descriptor.h"
#include "efm32pg23_ldmaxbar_defines.h"

/** @} End of group EFM32PG23B200F512GM48_Peripheral_TypeDefs  */

/**************************************************************************//**
 * @defgroup EFM32PG23B200F512GM48_Peripheral_Base EFM32PG23B200F512GM48 Peripheral Memory Map
 * @{
 *****************************************************************************/

#define SCRATCHPAD_BASE           (0x40000000UL) /* SCRATCHPAD base address */
#define EMU_BASE                  (0x40004000UL) /* EMU base address */
#define CMU_BASE                  (0x40008000UL) /* CMU base address */
#define HFRCO0_BASE               (0x40010000UL) /* HFRCO0 base address */
#define FSRCO_BASE                (0x40018000UL) /* FSRCO base address */
#define DPLL0_BASE                (0x4001C000UL) /* DPLL0 base address */
#define LFXO_BASE                 (0x40020000UL) /* LFXO base address */
#define LFRCO_BASE                (0x40024000UL) /* LFRCO base address */
#define ULFRCO_BASE               (0x40028000UL) /* ULFRCO base address */
#define MSC_BASE                  (0x40030000UL) /* MSC base address */
#define ICACHE0_BASE              (0x40034000UL) /* ICACHE0 base address */
#define PRS_BASE                  (0x40038000UL) /* PRS base address */
#define GPIO_BASE                 (0x4003C000UL) /* GPIO base address */
#define LDMA_BASE                 (0x40040000UL) /* LDMA base address */
#define LDMAXBAR_BASE             (0x40044000UL) /* LDMAXBAR base address */
#define TIMER0_BASE               (0x40048000UL) /* TIMER0 base address */
#define TIMER1_BASE               (0x4004C000UL) /* TIMER1 base address */
#define TIMER2_BASE               (0x40050000UL) /* TIMER2 base address */
#define TIMER3_BASE               (0x40054000UL) /* TIMER3 base address */
#define TIMER4_BASE               (0x40058000UL) /* TIMER4 base address */
#define USART0_BASE               (0x4005C000UL) /* USART0 base address */
#define BURTC_BASE                (0x40064000UL) /* BURTC base address */
#define I2C1_BASE                 (0x40068000UL) /* I2C1 base address */
#define SYSCFG_CFGNS_BASE         (0x40078000UL) /* SYSCFG_CFGNS base address */
#define SYSCFG_BASE               (0x4007C000UL) /* SYSCFG base address */
#define BURAM_BASE                (0x40080000UL) /* BURAM base address */
#define GPCRC_BASE                (0x40088000UL) /* GPCRC base address */
#define DCDC_BASE                 (0x40094000UL) /* DCDC base address */
#define HOSTMAILBOX_BASE          (0x40098000UL) /* HOSTMAILBOX base address */
#define EUSART1_BASE              (0x400A0000UL) /* EUSART1 base address */
#define EUSART2_BASE              (0x400A4000UL) /* EUSART2 base address */
#define SYSRTC0_BASE              (0x400A8000UL) /* SYSRTC0 base address */
#define LCD_BASE                  (0x400AC000UL) /* LCD base address */
#define KEYSCAN_BASE              (0x400B0000UL) /* KEYSCAN base address */
#define DMEM_BASE                 (0x400B4000UL) /* DMEM base address */
#define LCDRF_BASE                (0x400C0000UL) /* LCDRF base address */
#define PFMXPPRF_BASE             (0x400C4000UL) /* PFMXPPRF base address */
#define RADIOAES_BASE             (0x44000000UL) /* RADIOAES base address */
#define SMU_BASE                  (0x44008000UL) /* SMU base address */
#define SMU_CFGNS_BASE            (0x4400C000UL) /* SMU_CFGNS base address */
#define LETIMER0_BASE             (0x49000000UL) /* LETIMER0 base address */
#define IADC0_BASE                (0x49004000UL) /* IADC0 base address */
#define ACMP0_BASE                (0x49008000UL) /* ACMP0 base address */
#define ACMP1_BASE                (0x4900C000UL) /* ACMP1 base address */
#define AMUXCP0_BASE              (0x49020000UL) /* AMUXCP0 base address */
#define VDAC0_BASE                (0x49024000UL) /* VDAC0 base address */
#define PCNT0_BASE                (0x49030000UL) /* PCNT0 base address */
#define LESENSE_BASE              (0x49038000UL) /* LESENSE base address */
#define HFRCOEM23_BASE            (0x4A000000UL) /* HFRCOEM23 base address */
#define HFXO0_BASE                (0x4A004000UL) /* HFXO0 base address */
#define I2C0_BASE                 (0x4B000000UL) /* I2C0 base address */
#define WDOG0_BASE                (0x4B004000UL) /* WDOG0 base address */
#define WDOG1_BASE                (0x4B008000UL) /* WDOG1 base address */
#define EUSART0_BASE              (0x4B010000UL) /* EUSART0 base address */
#define SEMAILBOX_HOST_BASE       (0x4C000000UL) /* SEMAILBOX_HOST base address */
#define SCRATCHPAD_NS_BASE        (0x50000000UL) /* SCRATCHPAD_NS base address */
#define EMU_NS_BASE               (0x50004000UL) /* EMU_NS base address */
#define CMU_NS_BASE               (0x50008000UL) /* CMU_NS base address */
#define HFRCO0_NS_BASE            (0x50010000UL) /* HFRCO0_NS base address */
#define FSRCO_NS_BASE             (0x50018000UL) /* FSRCO_NS base address */
#define DPLL0_NS_BASE             (0x5001C000UL) /* DPLL0_NS base address */
#define LFXO_NS_BASE              (0x50020000UL) /* LFXO_NS base address */
#define LFRCO_NS_BASE             (0x50024000UL) /* LFRCO_NS base address */
#define ULFRCO_NS_BASE            (0x50028000UL) /* ULFRCO_NS base address */
#define MSC_NS_BASE               (0x50030000UL) /* MSC_NS base address */
#define ICACHE0_NS_BASE           (0x50034000UL) /* ICACHE0_NS base address */
#define PRS_NS_BASE               (0x50038000UL) /* PRS_NS base address */
#define GPIO_NS_BASE              (0x5003C000UL) /* GPIO_NS base address */
#define LDMA_NS_BASE              (0x50040000UL) /* LDMA_NS base address */
#define LDMAXBAR_NS_BASE          (0x50044000UL) /* LDMAXBAR_NS base address */
#define TIMER0_NS_BASE            (0x50048000UL) /* TIMER0_NS base address */
#define TIMER1_NS_BASE            (0x5004C000UL) /* TIMER1_NS base address */
#define TIMER2_NS_BASE            (0x50050000UL) /* TIMER2_NS base address */
#define TIMER3_NS_BASE            (0x50054000UL) /* TIMER3_NS base address */
#define TIMER4_NS_BASE            (0x50058000UL) /* TIMER4_NS base address */
#define USART0_NS_BASE            (0x5005C000UL) /* USART0_NS base address */
#define BURTC_NS_BASE             (0x50064000UL) /* BURTC_NS base address */
#define I2C1_NS_BASE              (0x50068000UL) /* I2C1_NS base address */
#define SYSCFG_NS_CFGNS_BASE      (0x50078000UL) /* SYSCFG_NS_CFGNS base address */
#define SYSCFG_NS_BASE            (0x5007C000UL) /* SYSCFG_NS base address */
#define BURAM_NS_BASE             (0x50080000UL) /* BURAM_NS base address */
#define GPCRC_NS_BASE             (0x50088000UL) /* GPCRC_NS base address */
#define DCDC_NS_BASE              (0x50094000UL) /* DCDC_NS base address */
#define HOSTMAILBOX_NS_BASE       (0x50098000UL) /* HOSTMAILBOX_NS base address */
#define EUSART1_NS_BASE           (0x500A0000UL) /* EUSART1_NS base address */
#define EUSART2_NS_BASE           (0x500A4000UL) /* EUSART2_NS base address */
#define SYSRTC0_NS_BASE           (0x500A8000UL) /* SYSRTC0_NS base address */
#define LCD_NS_BASE               (0x500AC000UL) /* LCD_NS base address */
#define KEYSCAN_NS_BASE           (0x500B0000UL) /* KEYSCAN_NS base address */
#define DMEM_NS_BASE              (0x500B4000UL) /* DMEM_NS base address */
#define LCDRF_NS_BASE             (0x500C0000UL) /* LCDRF_NS base address */
#define PFMXPPRF_NS_BASE          (0x500C4000UL) /* PFMXPPRF_NS base address */
#define RADIOAES_NS_BASE          (0x54000000UL) /* RADIOAES_NS base address */
#define SMU_NS_BASE               (0x54008000UL) /* SMU_NS base address */
#define SMU_NS_CFGNS_BASE         (0x5400C000UL) /* SMU_NS_CFGNS base address */
#define LETIMER0_NS_BASE          (0x59000000UL) /* LETIMER0_NS base address */
#define IADC0_NS_BASE             (0x59004000UL) /* IADC0_NS base address */
#define ACMP0_NS_BASE             (0x59008000UL) /* ACMP0_NS base address */
#define ACMP1_NS_BASE             (0x5900C000UL) /* ACMP1_NS base address */
#define AMUXCP0_NS_BASE           (0x59020000UL) /* AMUXCP0_NS base address */
#define VDAC0_NS_BASE             (0x59024000UL) /* VDAC0_NS base address */
#define PCNT0_NS_BASE             (0x59030000UL) /* PCNT0_NS base address */
#define LESENSE_NS_BASE           (0x59038000UL) /* LESENSE_NS base address */
#define HFRCOEM23_NS_BASE         (0x5A000000UL) /* HFRCOEM23_NS base address */
#define HFXO0_NS_BASE             (0x5A004000UL) /* HFXO0_NS base address */
#define I2C0_NS_BASE              (0x5B000000UL) /* I2C0_NS base address */
#define WDOG0_NS_BASE             (0x5B004000UL) /* WDOG0_NS base address */
#define WDOG1_NS_BASE             (0x5B008000UL) /* WDOG1_NS base address */
#define EUSART0_NS_BASE           (0x5B010000UL) /* EUSART0_NS base address */
#define SEMAILBOX_NS_HOST_BASE    (0x5C000000UL) /* SEMAILBOX_NS_HOST base address */
#define DEVINFO_BASE              (0x0FE08000UL) /* DEVINFO base address */
/** @} End of group EFM32PG23B200F512GM48_Peripheral_Base */

/**************************************************************************//**
 * @defgroup EFM32PG23B200F512GM48_Peripheral_Declaration EFM32PG23B200F512GM48 Peripheral Declarations Map
 * @{
 *****************************************************************************/

